* Classes
** Linear Algebra
*** DONE MyMathLab work <2015-09-21 Mon>
    CLOSED: [2015-09-20 Sun 14:47]
*** DONE MyMathLab work <2015-09-24 Thu>
    CLOSED: [2015-09-20 Sun 16:48]
*** Talk to Dr. Brown (just for kicks)
** Physics
*** Mastering Physics
**** DONE Finish assignment 3 continued <2015-09-23 Wed>
     CLOSED: [2015-09-26 Sat 19:21]
**** DONE Write last essay part for assignment 3 <2015-09-22 Tue>
     CLOSED: [2015-09-20 Sun 11:35]
**** DONE Finish lab work <2015-09-24 Thu>
     CLOSED: [2015-09-26 Sat 19:21]
     1. Parse lab data
     2. Write up report
** Production
*** Ripples
**** Deep Dive Part 1. <2015-10-07 Wed>
***** DONE [1/1] Integrate vectrocity
      CLOSED: [2015-10-18 Sun 13:55]
      1. [X] Get vectrocity replacing current implementation
***** TODO [3/4] Flesh out encounter creation
      CLOCK: [2015-10-04 Sun 18:46]--[2015-10-04 Sun 18:49] =>  0:03 -- Random stuff - Logged
      1. [X] Make jumping koreographer driven
      CLOCK: [2015-10-04 Sun 16:37]--[2015-10-04 Sun 18:46] =>  2:09 - Logged
      2. [X] Work on koreographer pipeline
      CLOCK: [2015-10-04 Sun 18:49]--[2015-10-04 Sun 20:34] =>  1:45 -- Copying events - Logged
      CLOCK: [2015-10-11 Sun 16:49]--[2015-10-11 Sun 17:44] =>  0:55 -- Discussed moving forward with Willie, started corpus of encounter - Logged
      CLOCK: [2015-10-11 Sun 18:04]--[2015-10-11 Sun 18:15] =>  0:11 -- Working on Anatomy - Logged
      CLOCK: [2015-10-13 Tue 15:19]--[2015-10-13 Tue 20:11] =>  4:52 - Logged
      3. [X] Work on AI
      CLOCK: [2015-10-18 Sun 13:55]--[2015-10-18 Sun 21:13] =>  7:18
      4. [ ] Work on AI more
      CLOCK: [2015-10-18 Sun 22:05]--[2015-10-18 Sun 23:21] =>  1:16
***** Clean up the code
      4 Hours - Logged
***** Work on the cast of characters
      CLOCK: [2015-10-16 Fri 19:35]--[2015-10-16 Fri 19:36] =>  0:01
      CLOCK: [2015-10-16 Fri 17:49]--[2015-10-16 Fri 19:29] =>  1:40
      CLOCK: [2015-10-16 Fri 17:37]--[2015-10-16 Fri 17:48] =>  0:11
**** Outlining prototype for week 5 
     CLOCK: [2015-09-23 Wed 15:40]--[2015-09-23 Wed 16:53] =>  1:13 - Logged
**** Prototype Music Integration
***** Goals:
      CLOCK: [2015-09-28 Mon 16:01]--[2015-09-28 Mon 16:50] =>  0:49 + 0:45 - Logged
      CLOCK: [2015-09-28 Mon 01:23]--[2015-09-28 Mon 02:18] =>  0:55 - Logged
      CLOCK: [2015-09-27 Sun 15:11]--[2015-09-27 Sun 17:03] => 1:52 - Logged
      CLOCK: [2015-09-27 Sun 12:20]--[2015-09-27 Sun 14:51] =>  2:31 - Logged
      1. Get beat matching working nicely for songs we add to the game.
      2. Get beat matching working for dynamically added songs.
      3. Think about secondary beat matching, i.e. the player is bumping to one theme and different enemies are on different themes. --THIS IS VERY POSSIBLE
      4. Look at interesting musical potential that comes up in the tools and think of uses.
***** Look at the viability of using beta Koreographer
      If this doesn't work, look into doing the stuff myself vs buying new Koreographer. file:Koreographer_Notes.org
*** Blogs
**** DONE Write third blog <2015-09-23 Wed>
     CLOSED: [2015-09-20 Sun 23:13]
     CLOCK: [2015-09-20 Sun 19:44]--[2015-09-20 Sun 20:47] =>  1:03 - Logged
**** DONE Write fourth blog
     CLOSED: [2015-10-03 Sat 11:59]
**** DONE Write fifth blog <2015-10-14 Wed>
     CLOSED: [2015-10-16 Fri 17:34]
     CLOCK: [2015-10-16 Fri 17:02]--[2015-10-16 Fri 17:33] =>  0:31
**** DONE Write sixth blog <2015-10-21 Wed>
     CLOSED: [2015-10-21 Wed 19:03]
**** TODO Write seventh blog <2015-10-28 Wed>
*** Two Masters
**** DONE Work on it <2015-09-19 Sat>
     CLOSED: [2015-09-19 Sat 18:46]
     CLOCK: [2015-09-19 Sat 17:04]--[2015-09-19 Sat 18:46] =>  1:42 - Logged
** Networking
*** DONE [4/4] Assignment 1 <2015-10-09 Fri>
    CLOSED: [2015-10-11 Sun 14:37]
    1. [X] Set up parts that Saad explained in class <2015-09-19 Sat>
    1. [X] Get basic networking going
    2. [X] Set up graphics library
    3. [X] Do actual networking
* Personal
